# Задача 18:
# Требуется найти в массиве A[1..N] самый близкий по величине элемент к заданному числу X.
# Пользователь вводит натуральное число N – количество элементов в массиве и число, которое необходимо проверить - X.
# Заполните массив случайными натуральными числами от 1 до N.
# Выведите, ближайший к X элемент. Если есть несколько элементов, которые равноудалены от X, выведите наименьший по величине.

# Ввод: 10
# Ввод: 7
# 1 2 1 8 9 6 5 4 3 4
# Вывод: 6
import random

def element_close_in_value(n,x):
    array = []
    for i in range(0, n):
        value = random.randint(1, n)
        array.append(value)
    print(array)
    k = array[0]
    for i in range(len(array)):
        if (abs(array[i]-x) < abs(k-x) or abs(array[i]-x) == abs(k-x) and array[i] < k):
            k = array[i]
    return k        


try:
    n = int(input('Введите размер массива: '))
    x = int(input('Введите число для поиска: '))
    print(f'Самый близкий по величине элемент к заданному числу {x} = {element_close_in_value(n,x)}')
except:
     print('Некорректный ввод. Попробуйте еще раз!') 