# Задача 8
# Требуется определить, можно ли от шоколадки размером n × m долек отломить k долек,
# если разрешается сделать один разлом по прямой между дольками
# (то есть разломить шоколадку на два прямоугольника).
# Пример:
# 3 2 4 -> yes
# 3 2 1 -> no

m = int(input('Введите длинну шоколадки: '))
n = int(input('Введите ширину шоколадки: '))
k = int(input('Введите количество долек: '))

if k < m*n and (k % m == 0 or k % n == 0):
    print('Дольки отломить можно')
elif k==m*n:
    print('Ай-яй-яй! Вы хотите всю шоколадку!')    
else:
    print('Дольки отломить нельзя')
